app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.new(params.require(:school_class).permit(:title, :room_number))
    @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2018-04-05 07:37:43.008035"], ["updated_at", "2018-04-05 07:37:43.008035"]]

  def update
    @school_class = SchoolClass.find(params[:id])
@school_class.update(params.require(:school_class).permit(:title, :room_number)
redirect_to school_class_path(@school_class)
  end
end

---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2018-04-05 07:42:28.663835"], ["id", 1]]